import 'package:flutter/material.dart';

class Constants {

  static const String CONFIRMATION_1_1_Site_License= '''წინამდებარე განაცხადზე ხელმოწერით ვაცხადებ თანხმობას, რომ შპს „სკანი სოლუშენმა“ განახორციელოს, საქართველოს კანონით „პერსონალურ მონაცემთა დაცვის შესახებ“ გათვალისწინებული ჩემი პერსონალური მონაცემების დამუშავება, კერძოდ შპს „სკანი სოლუშენი“ უფლებამოსილია:
  
  ა) ჩემი გადამხდელუნარიანობის ანალიზის, ან ჩემთვის რაიმე სახის საკრედიტო პროდუქტის შეთავაზების მიზნით, ჩემი პერსონალური მონაცემები, შპს „სკანი სოლუშენის“ მიერ განსაზღვრული პერიოდულობით გადასცეს ნებისმიერ მესამე პირს (მათ შორის: სახელმწიფო სერვისების განვითარების სააგენტოს, მასთან არსებულ სტრუქტურულ ერთეულებს და ა. შ.)
  
  ბ) გამოითხოვოს ჩემს შესახებ ნებისმიერ მესამე პირთან დაცული პერსონალური მონაცემები, ზემოთ მოყვანილი „ა“ ქვეპუნქტით განსაზღვრული მიზნებისათვის.
  მომხმარებელი გამოხატავს თანხმობას და უფლებას აძლევს შპს "სკანი სოლუშენს" შეაგროვოს, დაამუშავოს მომხმარებლის შესახებ ინფორმაცია, მათ შორის ბიომეტრიული მონაცემები, ასევე სსიპ სახელმწიფო სერვისების განვითარების სააგენტოს ელექტრონულ ბაზაში დაცული ინფორმაცია გადამხდელუნარიანობის ანალიზის მიზნისათვის. მომხმარებლის ( მათ შორის , მონაცემთა სიბიექტის) მოთხოვნის შემთხვევაში, მონაცემთა დამმუშავებელი ვალდებულია გაასწოროს, განაახლოს, დაამატოს, დაბლოკოს, წაშალოს ან გაანადგუროს მონაცემები, თუ ისინი არასრულია, არაზუსტია, არ არის განახლებული, ან თუ მათი შეგროვება და დამუშავება განხორციელდა კანონის საწინააღმდეგოდ.
  ვებ-გვერდის მომხმარებელთა მონაცემი გროვდება და ინახება ლოგების სახით. მიღებული ინფორმაცია გამოიყენება და დამუშავება ხორციელდება სტატისტიკური ანალიზისთვის, ასევე, შესაძლო ინფორმაციული უსაფრთხოების ინციდენტების გამოვლენისა და ვებ ადმინისტრირების მიზნებისათვის. ვებ-გვერდზე მომხმარებელთა სტუმრობისას, სერვერზე ფიქსირდება ვებ-გვერდზე შესვლის თარიღი და მეთოდი, ინტერნეტ პროტოკოლის მისამართი, რეფერალი და დათვალიერებული რესურსის მისამართი.
  ვებ-გვერდზე Cookies გამოიყენება მომხმარებლისათვის საიტზე ნავიგაციის გამარტივების, ინფორმაციის სასურველი ფორმატით შეთავაზების და ძებნის პარამეტრების გაუმჯობესების მიზნით. Cookies მეშვეობით შესაძლებელია დადგინდეს ვიზიტორის მიერ ვებ-გვერდზე გატარებული დროის ხანგრძლივობა, გეოლოკაცია საიდანაც განხორციელდა ვებ-გვერდზე წვდომა და ინფორმაცია ვებგვერდზე არსებული ტექნიკური ხასიათის პრობლემის შესახებ.
  ''';



  static Color myColor = Colors.teal;
  static Icon myIcon = Icon(Icons.search , color: Colors.red,);
  static TextStyle myStyle = TextStyle(fontSize: 17, fontWeight: FontWeight.bold, color: Colors.green);

}